Tekla.Structures.ModelInternal.GeometryTree._NodesById


Tekla.Structures.ModelInternal.GeometryTree._NodesId


Tekla.Structures.ModelInternal.GeometryTree.FindCylindricalNodeConnection(Tekla.Structures.Model.IGeometryNode,Tekla.Structures.Model.IGeometryNode)
Finds common line segments between cylindrical surface node and polygon node.
node1: The first node is CylindricalSurfaceNode.
node2: The second node is PolygonNode.
Returns: Line segments connecting cylindrical and polygon nodes.